class GameState():
    def __init__(self):
        # создаем список из списков размерностью 8 x 8, во вложенных списках каждый элемент имеет два символа,
        # первый отвечает за цвет, второй за фигуру. "b" и "w" - это черный и белый соответственно,
        # "R", "N", "B", "K", "Q", "P" - ладья, конь, слон, король, королева, пешка.
        # "--" - означает пустую клетку.
        self.board = [
            ["bR", "bN", "bB", "bK", "bQ", "bB", "bN", "bR"],
            ["bP", "bP", "bP", "bP", "bP", "bP", "bP", "bP"],
            ["--", "--", "--", "--", "--", "--", "--", "--"],
            ["--", "--", "--", "--", "--", "--", "--", "--"],
            ["--", "--", "--", "--", "--", "--", "--", "--"],
            ["--", "--", "--", "--", "--", "--", "--", "--"],
            ["wP", "wP", "wP", "wP", "wP", "wP", "wP", "wP"],
            ["wR", "wN", "wB", "wQ", "wK", "wB", "wN", "wR"]
        ]
